{"format": "graph-model", "generatedBy": "2.17.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"input_1": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "128"}, {"size": "128"}, {"size": "3"}]}}}, "outputs": {"output_layer": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "128"}, {"size": "128"}, {"size": "5"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_1_0/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_1_0/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_1_0/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_1_0/stack/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_1_0/stack/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_1_0/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_1_0/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "2"}, {"size": "16"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_1_0/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/merge_0_1/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_1_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_1_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_1_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_1_1/stack/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_1_1/stack/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_1_1/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_1_1/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "2"}, {"size": "16"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_1_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/merge_0_2/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_1_2/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_1_2/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_1_2/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_1_2/stack/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_1_2/stack/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_1_2/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_1_2/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "2"}, {"size": "16"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_2_0/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_2_0/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_2_0/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_2_0/stack/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_2_0/stack/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_2_0/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_2_0/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "2"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_2_0/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/merge_1_1/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_2_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_2_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_2_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_2_1/stack/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_2_1/stack/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_2_1/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_2_1/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "2"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_3_0/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_3_0/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_3_0/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_3_0/stack/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_3_0/stack/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_3_0/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_3_0/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "2"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_3_0/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/merge_2_1/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_2_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/merge_1_2/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_1_2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/merge_0_3/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/output_layer/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}, {"size": "5"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/output_layer/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "128"}, {"size": "128"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_0_0_a_conv/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_0_0_a_conv/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_0_2_a_conv/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_0_0_b_conv/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_0_0_b_conv/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_0_2_a_conv/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_1_0_a_conv/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_0_3_a_conv/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_1_0_a_conv/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_1_0_b_conv/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_0_2_b_conv/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_1_0_b_conv/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_2_0_a_conv/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_0_2_b_conv/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_2_0_a_conv/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_2_0_b_conv/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_2_0_b_conv/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_1_2_a_conv/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "96"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_0_1_a_conv/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_0_3_b_conv/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_0_1_a_conv/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_1_2_a_conv/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_0_1_b_conv/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_0_1_b_conv/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_3_0_a_conv/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_1_2_b_conv/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_3_0_a_conv/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_0_3_b_conv/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_3_0_b_conv/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_1_2_b_conv/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_3_0_b_conv/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_1_1_a_conv/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_1_1_a_conv/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_1_1_b_conv/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_1_1_b_conv/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_2_1_a_conv/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_2_1_a_conv/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_2_1_b_conv/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_2_1_b_conv/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_0_3_a_conv/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_0_0_a_act/Relu", "op": "_FusedConv2D", "input": ["input_1", "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_0_0_a_conv/Conv2D_weights", "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_0_0_a_conv/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "128"}, {"size": "128"}, {"size": "-15"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "16"}]}]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_0_0_b_act/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/U-Net_plus_plus_4levels/x_0_0_a_act/Relu", "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_0_0_b_conv/Conv2D_weights", "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_0_0_b_conv/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "128"}, {"size": "128"}, {"size": "16"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/maxpool/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/U-Net_plus_plus_4levels/x_0_0_b_act/Relu"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_1_0_a_act/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/U-Net_plus_plus_4levels/maxpool/MaxPool", "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_1_0_a_conv/Conv2D_weights", "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_1_0_a_conv/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "64"}, {"size": "64"}, {"size": "16"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "32"}]}]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_1_0_b_act/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/U-Net_plus_plus_4levels/x_1_0_a_act/Relu", "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_1_0_b_conv/Conv2D_weights", "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_1_0_b_conv/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "64"}, {"size": "64"}, {"size": "32"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_1_0/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/U-Net_plus_plus_4levels/x_1_0_b_act/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/maxpool/MaxPool_1", "op": "MaxPool", "input": ["StatefulPartitionedCall/U-Net_plus_plus_4levels/x_1_0_b_act/Relu"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_1_0/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/U-Net_plus_plus_4levels/up_1_0/Shape", "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_1_0/strided_slice/stack", "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_1_0/strided_slice/stack_1", "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_1_0/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_2_0_a_act/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/U-Net_plus_plus_4levels/maxpool/MaxPool_1", "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_2_0_a_conv/Conv2D_weights", "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_2_0_a_conv/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "32"}, {"size": "32"}, {"size": "32"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_1_0/stack", "op": "Pack", "input": ["StatefulPartitionedCall/U-Net_plus_plus_4levels/up_1_0/strided_slice", "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_1_0/stack/1", "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_1_0/stack/2", "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_1_0/stack/3"], "attr": {"N": {"i": "4"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_2_0_b_act/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/U-Net_plus_plus_4levels/x_2_0_a_act/Relu", "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_2_0_b_conv/Conv2D_weights", "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_2_0_b_conv/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "32"}, {"size": "32"}, {"size": "64"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}]}}, "filter_format": {"s": "SFdJTw=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_1_0/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/U-Net_plus_plus_4levels/up_1_0/stack", "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_1_0/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_1_0_b_act/Relu"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_2_0/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/U-Net_plus_plus_4levels/x_2_0_b_act/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/maxpool/MaxPool_2", "op": "MaxPool", "input": ["StatefulPartitionedCall/U-Net_plus_plus_4levels/x_2_0_b_act/Relu"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_1_0/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/U-Net_plus_plus_4levels/up_1_0/conv2d_transpose", "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_1_0/BiasAdd/ReadVariableOp"], "attr": {"_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "128"}, {"size": "128"}, {"size": "16"}]}, {"dim": [{"size": "16"}]}]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_2_0/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/U-Net_plus_plus_4levels/up_2_0/Shape", "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_2_0/strided_slice/stack", "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_2_0/strided_slice/stack_1", "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_2_0/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_3_0_a_act/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/U-Net_plus_plus_4levels/maxpool/MaxPool_2", "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_3_0_a_conv/Conv2D_weights", "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_3_0_a_conv/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-16"}, {"size": "-17"}, {"size": "64"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/merge_0_1/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/U-Net_plus_plus_4levels/x_0_0_b_act/Relu", "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_1_0/BiasAdd", "StatefulPartitionedCall/U-Net_plus_plus_4levels/merge_0_1/concat/axis"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_2_0/stack", "op": "Pack", "input": ["StatefulPartitionedCall/U-Net_plus_plus_4levels/up_2_0/strided_slice", "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_2_0/stack/1", "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_2_0/stack/2", "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_2_0/stack/3"], "attr": {"N": {"i": "4"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_3_0_b_act/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/U-Net_plus_plus_4levels/x_3_0_a_act/Relu", "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_3_0_b_conv/Conv2D_weights", "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_3_0_b_conv/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-16"}, {"size": "-17"}, {"size": "128"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_0_1_a_act/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/U-Net_plus_plus_4levels/merge_0_1/concat", "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_0_1_a_conv/Conv2D_weights", "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_0_1_a_conv/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "128"}, {"size": "128"}, {"size": "32"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "16"}]}]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_2_0/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/U-Net_plus_plus_4levels/up_2_0/stack", "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_2_0/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_2_0_b_act/Relu"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_3_0/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/U-Net_plus_plus_4levels/x_3_0_b_act/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_0_1_b_act/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/U-Net_plus_plus_4levels/x_0_1_a_act/Relu", "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_0_1_b_conv/Conv2D_weights", "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_0_1_b_conv/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "128"}, {"size": "128"}, {"size": "16"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}]}}, "filter_format": {"s": "SFdJTw=="}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_2_0/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/U-Net_plus_plus_4levels/up_2_0/conv2d_transpose", "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_2_0/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "64"}, {"size": "64"}, {"size": "32"}]}, {"dim": [{"size": "32"}]}]}}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_3_0/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/U-Net_plus_plus_4levels/up_3_0/Shape", "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_3_0/strided_slice/stack", "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_3_0/strided_slice/stack_1", "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_3_0/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/merge_1_1/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/U-Net_plus_plus_4levels/x_1_0_b_act/Relu", "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_2_0/BiasAdd", "StatefulPartitionedCall/U-Net_plus_plus_4levels/merge_1_1/concat/axis"], "attr": {"N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_3_0/stack", "op": "Pack", "input": ["StatefulPartitionedCall/U-Net_plus_plus_4levels/up_3_0/strided_slice", "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_3_0/stack/1", "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_3_0/stack/2", "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_3_0/stack/3"], "attr": {"N": {"i": "4"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_1_1_a_act/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/U-Net_plus_plus_4levels/merge_1_1/concat", "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_1_1_a_conv/Conv2D_weights", "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_1_1_a_conv/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "64"}, {"size": "64"}, {"size": "64"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "32"}]}]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_3_0/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/U-Net_plus_plus_4levels/up_3_0/stack", "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_3_0/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_3_0_b_act/Relu"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_1_1_b_act/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/U-Net_plus_plus_4levels/x_1_1_a_act/Relu", "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_1_1_b_conv/Conv2D_weights", "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_1_1_b_conv/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "64"}, {"size": "64"}, {"size": "32"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}]}}, "filter_format": {"s": "SFdJTw=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_3_0/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/U-Net_plus_plus_4levels/up_3_0/conv2d_transpose", "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_3_0/BiasAdd/ReadVariableOp"], "attr": {"_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "32"}, {"size": "32"}, {"size": "64"}]}, {"dim": [{"size": "64"}]}]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_1_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/U-Net_plus_plus_4levels/x_1_1_b_act/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/merge_2_1/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/U-Net_plus_plus_4levels/x_2_0_b_act/Relu", "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_3_0/BiasAdd", "StatefulPartitionedCall/U-Net_plus_plus_4levels/merge_2_1/concat/axis"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_1_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/U-Net_plus_plus_4levels/up_1_1/Shape", "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_1_1/strided_slice/stack", "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_1_1/strided_slice/stack_1", "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_1_1/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_2_1_a_act/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/U-Net_plus_plus_4levels/merge_2_1/concat", "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_2_1_a_conv/Conv2D_weights", "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_2_1_a_conv/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "32"}, {"size": "32"}, {"size": "128"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "64"}]}]}}, "filter_format": {"s": "SFdJTw=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_1_1/stack", "op": "Pack", "input": ["StatefulPartitionedCall/U-Net_plus_plus_4levels/up_1_1/strided_slice", "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_1_1/stack/1", "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_1_1/stack/2", "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_1_1/stack/3"], "attr": {"N": {"i": "4"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_2_1_b_act/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/U-Net_plus_plus_4levels/x_2_1_a_act/Relu", "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_2_1_b_conv/Conv2D_weights", "StatefulPartitionedCall/U-Net_plus_plus_4levels/x_2_1_b_conv/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "32"}, {"size": "32"}, {"size": "64"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/U-Net_plus_plus_4levels/up_1_1/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/U-Net_plus_plus_4levels/up_1_1/stack", 