{"format": "graph-model", "generatedBy": "2.17.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"input_image": {"name": "input_image:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "128"}, {"size": "128"}, {"size": "3"}]}}}, "outputs": {"segmentation": {"name": "Identity_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "128"}, {"size": "128"}, {"size": "1"}]}}, "corners": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "128"}, {"size": "128"}, {"size": "4"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/4_unet/corners/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/corners/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_8/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_8/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_9/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_9/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/up_sampling2d/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_6/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_6/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_7/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_7/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/concatenate/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_10/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_10/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_11/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_11/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/up_sampling2d_1/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_4/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_4/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_5/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_5/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/concatenate_1/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_12/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_12/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_13/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_13/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/up_sampling2d_2/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_2/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_3/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_3/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/concatenate_2/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_14/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_14/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_15/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_15/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/up_sampling2d_3/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_1/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/concatenate_3/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_16/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_16/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_17/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_17/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/segmentation/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/segmentation/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_image", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "128"}, {"size": "128"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d/Relu", "op": "_FusedConv2D", "input": ["input_image", "StatefulPartitionedCall/4_unet/conv2d/Conv2D/ReadVariableOp", "StatefulPartitionedCall/4_unet/conv2d/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "128"}, {"size": "128"}, {"size": "-11"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "16"}]}]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/4_unet/conv2d/Relu", "StatefulPartitionedCall/4_unet/conv2d_1/Conv2D/ReadVariableOp", "StatefulPartitionedCall/4_unet/conv2d_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "128"}, {"size": "128"}, {"size": "16"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}]}}, "filter_format": {"s": "SFdJTw=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/max_pooling2d/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/4_unet/conv2d_1/Relu"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_2/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/4_unet/max_pooling2d/MaxPool", "StatefulPartitionedCall/4_unet/conv2d_2/Conv2D/ReadVariableOp", "StatefulPartitionedCall/4_unet/conv2d_2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "64"}, {"size": "64"}, {"size": "16"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "32"}]}]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_3/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/4_unet/conv2d_2/Relu", "StatefulPartitionedCall/4_unet/conv2d_3/Conv2D/ReadVariableOp", "StatefulPartitionedCall/4_unet/conv2d_3/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "64"}, {"size": "64"}, {"size": "32"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/max_pooling2d_1/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/4_unet/conv2d_3/Relu"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_4/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/4_unet/max_pooling2d_1/MaxPool", "StatefulPartitionedCall/4_unet/conv2d_4/Conv2D/ReadVariableOp", "StatefulPartitionedCall/4_unet/conv2d_4/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "32"}, {"size": "32"}, {"size": "32"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}]}}, "filter_format": {"s": "SFdJTw=="}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_5/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/4_unet/conv2d_4/Relu", "StatefulPartitionedCall/4_unet/conv2d_5/Conv2D/ReadVariableOp", "StatefulPartitionedCall/4_unet/conv2d_5/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "32"}, {"size": "32"}, {"size": "32"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}]}}, "filter_format": {"s": "SFdJTw=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/max_pooling2d_2/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/4_unet/conv2d_5/Relu"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_6/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/4_unet/max_pooling2d_2/MaxPool", "StatefulPartitionedCall/4_unet/conv2d_6/Conv2D/ReadVariableOp", "StatefulPartitionedCall/4_unet/conv2d_6/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "16"}, {"size": "16"}, {"size": "32"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}]}}, "filter_format": {"s": "SFdJTw=="}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_7/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/4_unet/conv2d_6/Relu", "StatefulPartitionedCall/4_unet/conv2d_7/Conv2D/ReadVariableOp", "StatefulPartitionedCall/4_unet/conv2d_7/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "16"}, {"size": "16"}, {"size": "32"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/max_pooling2d_3/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/4_unet/conv2d_7/Relu"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_8/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/4_unet/max_pooling2d_3/MaxPool", "StatefulPartitionedCall/4_unet/conv2d_8/Conv2D/ReadVariableOp", "StatefulPartitionedCall/4_unet/conv2d_8/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-12"}, {"size": "-13"}, {"size": "32"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_9/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/4_unet/conv2d_8/Relu", "StatefulPartitionedCall/4_unet/conv2d_9/Conv2D/ReadVariableOp", "StatefulPartitionedCall/4_unet/conv2d_9/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-12"}, {"size": "-13"}, {"size": "32"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}]}}, "filter_format": {"s": "SFdJTw=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/up_sampling2d/resize/ResizeNearestNeighbor", "op": "ResizeNearestNeighbor", "input": ["StatefulPartitionedCall/4_unet/conv2d_9/Relu", "StatefulPartitionedCall/4_unet/up_sampling2d/mul"], "attr": {"T": {"type": "DT_FLOAT"}, "align_corners": {"b": false}, "half_pixel_centers": {"b": true}}}, {"name": "StatefulPartitionedCall/4_unet/concatenate/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/4_unet/up_sampling2d/resize/ResizeNearestNeighbor", "StatefulPartitionedCall/4_unet/conv2d_7/Relu", "StatefulPartitionedCall/4_unet/concatenate/concat/axis"], "attr": {"N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_10/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/4_unet/concatenate/concat", "StatefulPartitionedCall/4_unet/conv2d_10/Conv2D/ReadVariableOp", "StatefulPartitionedCall/4_unet/conv2d_10/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "16"}, {"size": "16"}, {"size": "64"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "32"}]}]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_11/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/4_unet/conv2d_10/Relu", "StatefulPartitionedCall/4_unet/conv2d_11/Conv2D/ReadVariableOp", "StatefulPartitionedCall/4_unet/conv2d_11/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "16"}, {"size": "16"}, {"size": "32"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}]}}, "filter_format": {"s": "SFdJTw=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/up_sampling2d_1/resize/ResizeNearestNeighbor", "op": "ResizeNearestNeighbor", "input": ["StatefulPartitionedCall/4_unet/conv2d_11/Relu", "StatefulPartitionedCall/4_unet/up_sampling2d_1/mul"], "attr": {"T": {"type": "DT_FLOAT"}, "align_corners": {"b": false}, "half_pixel_centers": {"b": true}}}, {"name": "StatefulPartitionedCall/4_unet/concatenate_1/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/4_unet/up_sampling2d_1/resize/ResizeNearestNeighbor", "StatefulPartitionedCall/4_unet/conv2d_5/Relu", "StatefulPartitionedCall/4_unet/concatenate_1/concat/axis"], "attr": {"N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_12/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/4_unet/concatenate_1/concat", "StatefulPartitionedCall/4_unet/conv2d_12/Conv2D/ReadVariableOp", "StatefulPartitionedCall/4_unet/conv2d_12/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "32"}, {"size": "32"}, {"size": "64"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "32"}]}]}}, "filter_format": {"s": "SFdJTw=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_13/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/4_unet/conv2d_12/Relu", "StatefulPartitionedCall/4_unet/conv2d_13/Conv2D/ReadVariableOp", "StatefulPartitionedCall/4_unet/conv2d_13/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "32"}, {"size": "32"}, {"size": "32"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}]}}, "filter_format": {"s": "SFdJTw=="}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/up_sampling2d_2/resize/ResizeNearestNeighbor", "op": "ResizeNearestNeighbor", "input": ["StatefulPartitionedCall/4_unet/conv2d_13/Relu", "StatefulPartitionedCall/4_unet/up_sampling2d_2/mul"], "attr": {"T": {"type": "DT_FLOAT"}, "align_corners": {"b": false}, "half_pixel_centers": {"b": true}}}, {"name": "StatefulPartitionedCall/4_unet/concatenate_2/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/4_unet/up_sampling2d_2/resize/ResizeNearestNeighbor", "StatefulPartitionedCall/4_unet/conv2d_3/Relu", "StatefulPartitionedCall/4_unet/concatenate_2/concat/axis"], "attr": {"N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_14/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/4_unet/concatenate_2/concat", "StatefulPartitionedCall/4_unet/conv2d_14/Conv2D/ReadVariableOp", "StatefulPartitionedCall/4_unet/conv2d_14/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "64"}, {"size": "64"}, {"size": "64"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "32"}]}]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_15/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/4_unet/conv2d_14/Relu", "StatefulPartitionedCall/4_unet/conv2d_15/Conv2D/ReadVariableOp", "StatefulPartitionedCall/4_unet/conv2d_15/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "64"}, {"size": "64"}, {"size": "32"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/up_sampling2d_3/resize/ResizeNearestNeighbor", "op": "ResizeNearestNeighbor", "input": ["StatefulPartitionedCall/4_unet/conv2d_15/Relu", "StatefulPartitionedCall/4_unet/up_sampling2d_3/mul"], "attr": {"T": {"type": "DT_FLOAT"}, "align_corners": {"b": false}, "half_pixel_centers": {"b": true}}}, {"name": "StatefulPartitionedCall/4_unet/concatenate_3/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/4_unet/up_sampling2d_3/resize/ResizeNearestNeighbor", "StatefulPartitionedCall/4_unet/conv2d_1/Relu", "StatefulPartitionedCall/4_unet/concatenate_3/concat/axis"], "attr": {"N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_16/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/4_unet/concatenate_3/concat", "StatefulPartitionedCall/4_unet/conv2d_16/Conv2D/ReadVariableOp", "StatefulPartitionedCall/4_unet/conv2d_16/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "128"}, {"size": "128"}, {"size": "48"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "16"}]}]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_17/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/4_unet/conv2d_16/Relu", "StatefulPartitionedCall/4_unet/conv2d_17/Conv2D/ReadVariableOp", "StatefulPartitionedCall/4_unet/conv2d_17/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "128"}, {"size": "128"}, {"size": "16"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/corners/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/4_unet/conv2d_17/Relu", "StatefulPartitionedCall/4_unet/corners/Conv2D/ReadVariableOp", "StatefulPartitionedCall/4_unet/corners/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "128"}, {"size": "128"}, {"size": "16"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "4"}]}]}}, "filter_format": {"s": "SFdJTw=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/segmentation/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/4_unet/conv2d_17/Relu", "StatefulPartitionedCall/4_unet/segmentation/Conv2D/ReadVariableOp", "StatefulPartitionedCall/4_unet/segmentation/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "128"}, {"size": "128"}, {"size": "16"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "1"}]}]}}, "filter_format": {"s": "SFdJTw=="}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/corners/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/4_unet/corners/BiasAdd"], "attr": {"_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "128"}, {"size": "128"}, {"size": "4"}]}]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/segmentation/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/4_unet/segmentation/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/4_unet/corners/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity_1", "op": "Identity", "input": ["StatefulPartitionedCall/4_unet/segmentation/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 2129}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/4_unet/corners/Conv2D/ReadVariableOp", "shape": [3, 3, 16, 4], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.9616764764575397, "scale": 0.004645780079505023, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/4_unet/corners/BiasAdd/ReadVariableOp", "shape": [4], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.3126097321510315, "scale": 0.0004641941365073709, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_8/Conv2D/ReadVariableOp", "shape": [3, 3, 32, 32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.56597899759517, "scale": 0.004387434089885039, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_8/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.2250199738670798, "scale": 0.0013394046063516655, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_9/Conv2D/ReadVariableOp", "shape": [3, 3, 32, 32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.6305080007104313, "scale": 0.00500403175167009, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_9/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.1405760732351565, "scale": 0.0010490751733966902, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/4_unet/up_sampling2d/mul", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/4_unet/conv2d_6/Conv2D/ReadVariableOp", "shape": [3, 3, 32, 32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.5378103700338626, "scale": 0.003633853851580152, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_6/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.14505219745869732, "scale": 0.0011987784913941927, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_7/Conv2D/ReadVariableOp", "shape": [3, 3, 32, 32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.5018940869499655, "scale": 0.003636913673550475, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_7/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.16737332046031952, "scale": 0.0010939432709824806, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/4_unet/concatenate/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/4_unet/conv2d_10/Conv2D/ReadVariableOp", "shape": [3, 3, 64, 32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.6669120774549596, "scale": 0.004506162685506484, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_10/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.05866545380330553, "scale": 0.0011733090760661106, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_11/Conv2D/ReadVariableOp", "shape": [3, 3, 32, 32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.5786803563435873, "scale": 0.004255002620173436, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_11/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.10332472225030263, "scale": 0.001396280030409495, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/4_unet/up_sampling2d_1/mul", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/4_unet/conv2d_4/Conv2D/ReadVariableOp", "shape": [3, 3, 32, 32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.8405216525582707, "scale": 0.005457932808819939, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_4/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.2701961138669182, "scale": 0.0015352051924256717, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_5/Conv2D/ReadVariableOp", "shape": [3, 3, 32, 32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.5831700600829779, "scale": 0.004352015373753566, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_5/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.2613437351350691, "scale": 0.0015106574285264109, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/4_unet/concatenate_1/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/4_unet/conv2d_12/Conv2D/ReadVariableOp", "shape": [3, 3, 64, 32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.8085696054439919, "scale": 0.005817047521179798, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_12/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.13725191705367146, "scale": 0.0015596808756099029, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_13/Conv2D/ReadVariableOp", "shape": [3, 3, 32, 32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.8477036775327196, "scale": 0.0055769978785047344, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_13/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.3416552915292628, "scale": 0.0024060231797835407, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/4_unet/up_sampling2d_2/mul", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/4_unet/conv2d_2/Conv2D/ReadVariableOp", "shape": [3, 3, 16, 32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.7584995031356812, "scale": 0.005056663354237875, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_2/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.05891389764991461, "scale": 0.0008297732063368255, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_3/Conv2D/ReadVariableOp", "shape": [3, 3, 32, 32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.6639992030227885, "scale": 0.004517001381107405, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_3/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.10992786700234694, "scale": 0.0011103824949732014, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/4_unet/concatenate_2/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/4_unet/conv2d_14/Conv2D/ReadVariableOp", "shape": [3, 3, 64, 32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.0146620413836311, "scale": 0.006675408166997573, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_14/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.117809964161293, "scale": 0.005589049820806466, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_15/Conv2D/ReadVariableOp", "shape": [3, 3, 32, 32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.7027708263958202, "scale": 0.004780753921060001, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_15/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.1799617249591678, "scale": 0.0029026084670833513, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/4_unet/up_sampling2d_3/mul", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/4_unet/conv2d/Conv2D/ReadVariableOp", "shape": [3, 3, 3, 16], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.4333662875727112, "scale": 0.00311774307606267, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/4_unet/conv2d/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.026290626794684167, "scale": 0.00043099388188006833, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_1/Conv2D/ReadVariableOp", "shape": [3, 3, 16, 16], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.7678432796515671, "scale": 0.0057732577417411056, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_1/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.07274286916442946, "scale": 0.0010245474530201331, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/4_unet/concatenate_3/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/4_unet/conv2d_16/Conv2D/ReadVariableOp", "shape": [3, 3, 48, 16], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.5435401600949903, "scale": 0.009469571534325094, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_16/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.03950401918560851, "scale": 0.002079158904505711, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_17/Conv2D/ReadVariableOp", "shape": [3, 3, 16, 16], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.824326452554441, "scale": 0.005569773328070547, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_17/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.3123109172372257, "scale": 0.0026923354934243597, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/4_unet/segmentation/Conv2D/ReadVariableOp", "shape": [3, 3, 16, 1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.38561668618052614, "scale": 0.002395134696773454, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/4_unet/segmentation/BiasAdd/ReadVariableOp", "shape": [1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.06133825331926346, "scale": 1.0, "original_dtype": "float32"}}]}]}