{"format": "graph-model", "generatedBy": "2.17.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"input_image": {"name": "input_image:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "128"}, {"size": "128"}, {"size": "3"}]}}}, "outputs": {"segmentation": {"name": "Identity_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "128"}, {"size": "128"}, {"size": "1"}]}}, "corners": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "128"}, {"size": "128"}, {"size": "4"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/4_unet/corners/separable_conv2d/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/corners/separable_conv2d/ReadVariableOp_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/corners/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_8/separable_conv2d/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_8/separable_conv2d/ReadVariableOp_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_8/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_9/separable_conv2d/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_9/separable_conv2d/ReadVariableOp_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_9/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/up_sampling2d/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_6/separable_conv2d/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_6/separable_conv2d/ReadVariableOp_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_6/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_7/separable_conv2d/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_7/separable_conv2d/ReadVariableOp_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_7/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/concatenate/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_10/separable_conv2d/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_10/separable_conv2d/ReadVariableOp_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_10/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_11/separable_conv2d/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "96"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_11/separable_conv2d/ReadVariableOp_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "96"}, {"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_11/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/up_sampling2d_1/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_4/separable_conv2d/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_4/separable_conv2d/ReadVariableOp_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_4/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_5/separable_conv2d/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_5/separable_conv2d/ReadVariableOp_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_5/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/concatenate_1/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_12/separable_conv2d/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "160"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_12/separable_conv2d/ReadVariableOp_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "160"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_12/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_13/separable_conv2d/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_13/separable_conv2d/ReadVariableOp_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_13/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/up_sampling2d_2/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_2/separable_conv2d/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_2/separable_conv2d/ReadVariableOp_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_3/separable_conv2d/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_3/separable_conv2d/ReadVariableOp_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_3/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/concatenate_2/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_14/separable_conv2d/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "96"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_14/separable_conv2d/ReadVariableOp_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "96"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_14/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_15/separable_conv2d/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_15/separable_conv2d/ReadVariableOp_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_15/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/up_sampling2d_3/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d/separable_conv2d/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d/separable_conv2d/ReadVariableOp_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_1/separable_conv2d/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_1/separable_conv2d/ReadVariableOp_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/concatenate_3/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_16/separable_conv2d/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_16/separable_conv2d/ReadVariableOp_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_16/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_17/separable_conv2d/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_17/separable_conv2d/ReadVariableOp_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_17/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/segmentation/separable_conv2d/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/segmentation/separable_conv2d/ReadVariableOp_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/segmentation/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_image", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "128"}, {"size": "128"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d/separable_conv2d/depthwise", "op": "DepthwiseConv2dNative", "input": ["input_image", "StatefulPartitionedCall/4_unet/separable_conv2d/separable_conv2d/ReadVariableOp"], "attr": {"padding": {"s": "U0FNRQ=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-3"}, {"size": "-12"}, {"size": "-13"}, {"size": "3"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "1"}]}]}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d/Relu6", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/4_unet/separable_conv2d/separable_conv2d/depthwise", "StatefulPartitionedCall/4_unet/separable_conv2d/separable_conv2d/ReadVariableOp_1", "StatefulPartitionedCall/4_unet/separable_conv2d/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-3"}, {"size": "-12"}, {"size": "-13"}, {"size": "3"}]}, {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}, {"size": "32"}]}]}}, "filter_format": {"s": "SFdJTw=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_1/separable_conv2d/depthwise", "op": "DepthwiseConv2dNative", "input": ["StatefulPartitionedCall/4_unet/separable_conv2d/Relu6", "StatefulPartitionedCall/4_unet/separable_conv2d_1/separable_conv2d/ReadVariableOp"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-3"}, {"size": "-14"}, {"size": "-15"}, {"size": "32"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "1"}]}]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_1/Relu6", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/4_unet/separable_conv2d_1/separable_conv2d/depthwise", "StatefulPartitionedCall/4_unet/separable_conv2d_1/separable_conv2d/ReadVariableOp_1", "StatefulPartitionedCall/4_unet/separable_conv2d_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-3"}, {"size": "-14"}, {"size": "-15"}, {"size": "32"}]}, {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "32"}]}]}}, "filter_format": {"s": "SFdJTw=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/max_pooling2d/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/4_unet/separable_conv2d_1/Relu6"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_2/separable_conv2d/depthwise", "op": "DepthwiseConv2dNative", "input": ["StatefulPartitionedCall/4_unet/max_pooling2d/MaxPool", "StatefulPartitionedCall/4_unet/separable_conv2d_2/separable_conv2d/ReadVariableOp"], "attr": {"padding": {"s": "U0FNRQ=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-3"}, {"size": "-16"}, {"size": "-17"}, {"size": "32"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "1"}]}]}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_2/Relu6", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/4_unet/separable_conv2d_2/separable_conv2d/depthwise", "StatefulPartitionedCall/4_unet/separable_conv2d_2/separable_conv2d/ReadVariableOp_1", "StatefulPartitionedCall/4_unet/separable_conv2d_2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-3"}, {"size": "-16"}, {"size": "-17"}, {"size": "32"}]}, {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "32"}]}]}}, "filter_format": {"s": "SFdJTw=="}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_3/separable_conv2d/depthwise", "op": "DepthwiseConv2dNative", "input": ["StatefulPartitionedCall/4_unet/separable_conv2d_2/Relu6", "StatefulPartitionedCall/4_unet/separable_conv2d_3/separable_conv2d/ReadVariableOp"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-3"}, {"size": "-18"}, {"size": "-19"}, {"size": "32"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "1"}]}]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_3/Relu6", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/4_unet/separable_conv2d_3/separable_conv2d/depthwise", "StatefulPartitionedCall/4_unet/separable_conv2d_3/separable_conv2d/ReadVariableOp_1", "StatefulPartitionedCall/4_unet/separable_conv2d_3/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-3"}, {"size": "-18"}, {"size": "-19"}, {"size": "32"}]}, {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "32"}]}]}}, "filter_format": {"s": "SFdJTw=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/max_pooling2d_1/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/4_unet/separable_conv2d_3/Relu6"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_4/separable_conv2d/depthwise", "op": "DepthwiseConv2dNative", "input": ["StatefulPartitionedCall/4_unet/max_pooling2d_1/MaxPool", "StatefulPartitionedCall/4_unet/separable_conv2d_4/separable_conv2d/ReadVariableOp"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-3"}, {"size": "-20"}, {"size": "-21"}, {"size": "32"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "1"}]}]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_4/Relu6", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/4_unet/separable_conv2d_4/separable_conv2d/depthwise", "StatefulPartitionedCall/4_unet/separable_conv2d_4/separable_conv2d/ReadVariableOp_1", "StatefulPartitionedCall/4_unet/separable_conv2d_4/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-3"}, {"size": "-20"}, {"size": "-21"}, {"size": "32"}]}, {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "64"}]}]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_5/separable_conv2d/depthwise", "op": "DepthwiseConv2dNative", "input": ["StatefulPartitionedCall/4_unet/separable_conv2d_4/Relu6", "StatefulPartitionedCall/4_unet/separable_conv2d_5/separable_conv2d/ReadVariableOp"], "attr": {"padding": {"s": "U0FNRQ=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-3"}, {"size": "-22"}, {"size": "-23"}, {"size": "64"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "1"}]}]}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_5/Relu6", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/4_unet/separable_conv2d_5/separable_conv2d/depthwise", "StatefulPartitionedCall/4_unet/separable_conv2d_5/separable_conv2d/ReadVariableOp_1", "StatefulPartitionedCall/4_unet/separable_conv2d_5/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-3"}, {"size": "-22"}, {"size": "-23"}, {"size": "64"}]}, {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "64"}]}]}}, "filter_format": {"s": "SFdJTw=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/max_pooling2d_2/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/4_unet/separable_conv2d_5/Relu6"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_6/separable_conv2d/depthwise", "op": "DepthwiseConv2dNative", "input": ["StatefulPartitionedCall/4_unet/max_pooling2d_2/MaxPool", "StatefulPartitionedCall/4_unet/separable_conv2d_6/separable_conv2d/ReadVariableOp"], "attr": {"padding": {"s": "U0FNRQ=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-3"}, {"size": "-24"}, {"size": "-25"}, {"size": "64"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "1"}]}]}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_6/Relu6", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/4_unet/separable_conv2d_6/separable_conv2d/depthwise", "StatefulPartitionedCall/4_unet/separable_conv2d_6/separable_conv2d/ReadVariableOp_1", "StatefulPartitionedCall/4_unet/separable_conv2d_6/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-3"}, {"size": "-24"}, {"size": "-25"}, {"size": "64"}]}, {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "128"}]}]}}, "filter_format": {"s": "SFdJTw=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_7/separable_conv2d/depthwise", "op": "DepthwiseConv2dNative", "input": ["StatefulPartitionedCall/4_unet/separable_conv2d_6/Relu6", "StatefulPartitionedCall/4_unet/separable_conv2d_7/separable_conv2d/ReadVariableOp"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-3"}, {"size": "-26"}, {"size": "-27"}, {"size": "128"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "1"}]}]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_7/Relu6", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/4_unet/separable_conv2d_7/separable_conv2d/depthwise", "StatefulPartitionedCall/4_unet/separable_conv2d_7/separable_conv2d/ReadVariableOp_1", "StatefulPartitionedCall/4_unet/separable_conv2d_7/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-3"}, {"size": "-26"}, {"size": "-27"}, {"size": "128"}]}, {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "128"}]}]}}, "filter_format": {"s": "SFdJTw=="}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/max_pooling2d_3/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/4_unet/separable_conv2d_7/Relu6"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_8/separable_conv2d/depthwise", "op": "DepthwiseConv2dNative", "input": ["StatefulPartitionedCall/4_unet/max_pooling2d_3/MaxPool", "StatefulPartitionedCall/4_unet/separable_conv2d_8/separable_conv2d/ReadVariableOp"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-3"}, {"size": "-28"}, {"size": "-29"}, {"size": "128"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "1"}]}]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_8/Relu6", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/4_unet/separable_conv2d_8/separable_conv2d/depthwise", "StatefulPartitionedCall/4_unet/separable_conv2d_8/separable_conv2d/ReadVariableOp_1", "StatefulPartitionedCall/4_unet/separable_conv2d_8/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-3"}, {"size": "-28"}, {"size": "-29"}, {"size": "128"}]}, {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "128"}]}]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_9/separable_conv2d/depthwise", "op": "DepthwiseConv2dNative", "input": ["StatefulPartitionedCall/4_unet/separable_conv2d_8/Relu6", "StatefulPartitionedCall/4_unet/separable_conv2d_9/separable_conv2d/ReadVariableOp"], "attr": {"padding": {"s": "U0FNRQ=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-3"}, {"size": "-30"}, {"size": "-31"}, {"size": "128"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "1"}]}]}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_9/Relu6", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/4_unet/separable_conv2d_9/separable_conv2d/depthwise", "StatefulPartitionedCall/4_unet/separable_conv2d_9/separable_conv2d/ReadVariableOp_1", "StatefulPartitionedCall/4_unet/separable_conv2d_9/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-3"}, {"size": "-30"}, {"size": "-31"}, {"size": "128"}]}, {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "128"}]}]}}, "filter_format": {"s": "SFdJTw=="}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/up_sampling2d/resize/ResizeNearestNeighbor", "op": "ResizeNearestNeighbor", "input": ["StatefulPartitionedCall/4_unet/separable_conv2d_9/Relu6", "StatefulPartitionedCall/4_unet/up_sampling2d/mul"], "attr": {"T": {"type": "DT_FLOAT"}, "align_corners": {"b": false}, "half_pixel_centers": {"b": true}}}, {"name": "StatefulPartitionedCall/4_unet/concatenate/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/4_unet/up_sampling2d/resize/ResizeNearestNeighbor", "StatefulPartitionedCall/4_unet/separable_conv2d_7/Relu6", "StatefulPartitionedCall/4_unet/concatenate/concat/axis"], "attr": {"N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_10/separable_conv2d/depthwise", "op": "DepthwiseConv2dNative", "input": ["StatefulPartitionedCall/4_unet/concatenate/concat", "StatefulPartitionedCall/4_unet/separable_conv2d_10/separable_conv2d/ReadVariableOp"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-3"}, {"size": "16"}, {"size": "16"}, {"size": "256"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "1"}]}]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_10/Relu6", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/4_unet/separable_conv2d_10/separable_conv2d/depthwise", "StatefulPartitionedCall/4_unet/separable_conv2d_10/separable_conv2d/ReadVariableOp_1", "StatefulPartitionedCall/4_unet/separable_conv2d_10/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-3"}, {"size": "16"}, {"size": "16"}, {"size": "256"}]}, {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "96"}]}]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_11/separable_conv2d/depthwise", "op": "DepthwiseConv2dNative", "input": ["StatefulPartitionedCall/4_unet/separable_conv2d_10/Relu6", "StatefulPartitionedCall/4_unet/separable_conv2d_11/separable_conv2d/ReadVariableOp"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-3"}, {"size": "16"}, {"size": "16"}, {"size": "96"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "96"}, {"size": "1"}]}]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_11/Relu6", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/4_unet/separable_conv2d_11/separable_conv2d/depthwise", "StatefulPartitionedCall/4_unet/separable_conv2d_11/separable_conv2d/ReadVariableOp_1", "StatefulPartitionedCall/4_unet/separable_conv2d_11/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-3"}, {"size": "16"}, {"size": "16"}, {"size": "96"}]}, {"dim": [{"size": "1"}, {"size": "1"}, {"size": "96"}, {"size": "96"}]}]}}, "filter_format": {"s": "SFdJTw=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/up_sampling2d_1/resize/ResizeNearestNeighbor", "op": "ResizeNearestNeighbor", "input": ["StatefulPartitionedCall/4_unet/separable_conv2d_11/Relu6", "StatefulPartitionedCall/4_unet/up_sampling2d_1/mul"], "attr": {"T": {"type": "DT_FLOAT"}, "align_corners": {"b": false}, "half_pixel_centers": {"b": true}}}, {"name": "StatefulPartitionedCall/4_unet/concatenate_1/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/4_unet/up_sampling2d_1/resize/ResizeNearestNeighbor", "StatefulPartitionedCall/4_unet/separable_conv2d_5/Relu6", "StatefulPartitionedCall/4_unet/concatenate_1/concat/axis"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_12/separable_conv2d/depthwise", "op": "DepthwiseConv2dNative", "input": ["StatefulPartitionedCall/4_unet/concatenate_1/concat", "StatefulPartitionedCall/4_unet/separable_conv2d_12/separable_conv2d/ReadVariableOp"], "attr": {"padding": {"s": "U0FNRQ=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-3"}, {"size": "32"}, {"size": "32"}, {"size": "160"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "160"}, {"size": "1"}]}]}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_12/Relu6", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/4_unet/separable_conv2d_12/separable_conv2d/depthwise", "StatefulPartitionedCall/4_unet/separable_conv2d_12/separable_conv2d/ReadVariableOp_1", "StatefulPartitionedCall/4_unet/separable_conv2d_12/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-3"}, {"size": "32"}, {"size": "32"}, {"size": "160"}]}, {"dim": [{"size": "1"}, {"size": "1"}, {"size": "160"}, {"size": "64"}]}]}}, "filter_format": {"s": "SFdJTw=="}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_13/separable_conv2d/depthwise", "op": "DepthwiseConv2dNative", "input": ["StatefulPartitionedCall/4_unet/separable_conv2d_12/Relu6", "StatefulPartitionedCall/4_unet/separable_conv2d_13/separable_conv2d/ReadVariableOp"], "attr": {"padding": {"s": "U0FNRQ=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-3"}, {"size": "32"}, {"size": "32"}, {"size": "64"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "1"}]}]}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_13/Relu6", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/4_unet/separable_conv2d_13/separable_conv2d/depthwise", "StatefulPartitionedCall/4_unet/separable_conv2d_13/separable_conv2d/ReadVariableOp_1", "StatefulPartitionedCall/4_unet/separable_conv2d_13/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-3"}, {"size": "32"}, {"size": "32"}, {"size": "64"}]}, {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "64"}]}]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/up_sampling2d_2/resize/ResizeNearestNeighbor", "op": "ResizeNearestNeighbor", "input": ["StatefulPartitionedCall/4_unet/separable_conv2d_13/Relu6", "StatefulPartitionedCall/4_unet/up_sampling2d_2/mul"], "attr": {"T": {"type": "DT_FLOAT"}, "align_corners": {"b": false}, "half_pixel_centers": {"b": true}}}, {"name": "StatefulPartitionedCall/4_unet/concatenate_2/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/4_unet/up_sampling2d_2/resize/ResizeNearestNeighbor", "StatefulPartitionedCall/4_unet/separable_conv2d_3/Relu6", "StatefulPartitionedCall/4_unet/concatenate_2/concat/axis"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_14/separable_conv2d/depthwise", "op": "DepthwiseConv2dNative", "input": ["StatefulPartitionedCall/4_unet/concatenate_2/concat", "StatefulPartitionedCall/4_unet/separable_conv2d_14/separable_conv2d/ReadVariableOp"], "attr": {"padding": {"s": "U0FNRQ=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-3"}, {"size": "64"}, {"size": "64"}, {"size": "96"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "96"}, {"size": "1"}]}]}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_14/Relu6", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/4_unet/separable_conv2d_14/separable_conv2d/depthwise", "StatefulPartitionedCall/4_unet/separable_conv2d_14/separable_conv2d/ReadVariableOp_1", "StatefulPartitionedCall/4_unet/separable_conv2d_14/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-3"}, {"size": "64"}, {"size": "64"}, {"size": "96"}]}, {"dim": [{"size": "1"}, {"size": "1"}, {"size": "96"}, {"size": "32"}]}]}}, "filter_format": {"s": "SFdJTw=="}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_15/separable_conv2d/depthwise", "op": "DepthwiseConv2dNative", "input": ["StatefulPartitionedCall/4_unet/separable_conv2d_14/Relu6", "StatefulPartitionedCall/4_unet/separable_conv2d_15/separable_conv2d/ReadVariableOp"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-3"}, {"size": "64"}, {"size": "64"}, {"size": "32"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "1"}]}]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/separable_conv2d_15/Relu6", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/4_unet/separable_conv2d_15/separable_conv2d/depthwise", "StatefulPartitionedCall/4_unet/separable_conv2d_15/separable_conv2d/ReadVariableOp_1", "StatefulPartitionedCall/4_unet/separable_conv2d_15/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-3"}, {"size": "64"}, {"size": "64"}, {"size": "32"}]}, {"dim": [{"size": "1"}, {"size": "1"}, 