{"format": "graph-model", "generatedBy": "2.17.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"input_image": {"name": "input_image:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "128"}, {"size": "128"}, {"size": "3"}]}}}, "outputs": {"segmentation": {"name": "Identity_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "128"}, {"size": "128"}, {"size": "1"}]}}, "corners": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "128"}, {"size": "128"}, {"size": "4"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/4_unet/corners/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/corners/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_8/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_8/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_9/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_9/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/up_sampling2d/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_6/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_6/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_7/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_7/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/concatenate/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_10/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_10/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_11/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_11/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/up_sampling2d_1/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_4/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_4/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_5/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_5/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/concatenate_1/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_12/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_12/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_13/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_13/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/up_sampling2d_2/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_2/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_3/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_3/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/concatenate_2/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_14/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_14/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_15/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_15/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/up_sampling2d_3/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_1/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/concatenate_3/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_16/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_16/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_17/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_17/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/segmentation/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/segmentation/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_image", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "128"}, {"size": "128"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d/Relu", "op": "_FusedConv2D", "input": ["input_image", "StatefulPartitionedCall/4_unet/conv2d/Conv2D/ReadVariableOp", "StatefulPartitionedCall/4_unet/conv2d/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "128"}, {"size": "128"}, {"size": "-11"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "16"}]}]}}, "filter_format": {"s": "SFdJTw=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/4_unet/conv2d/Relu", "StatefulPartitionedCall/4_unet/conv2d_1/Conv2D/ReadVariableOp", "StatefulPartitionedCall/4_unet/conv2d_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "128"}, {"size": "128"}, {"size": "16"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/max_pooling2d/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/4_unet/conv2d_1/Relu"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_2/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/4_unet/max_pooling2d/MaxPool", "StatefulPartitionedCall/4_unet/conv2d_2/Conv2D/ReadVariableOp", "StatefulPartitionedCall/4_unet/conv2d_2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "64"}, {"size": "64"}, {"size": "16"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "32"}]}]}}, "filter_format": {"s": "SFdJTw=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_3/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/4_unet/conv2d_2/Relu", "StatefulPartitionedCall/4_unet/conv2d_3/Conv2D/ReadVariableOp", "StatefulPartitionedCall/4_unet/conv2d_3/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "64"}, {"size": "64"}, {"size": "32"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/max_pooling2d_1/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/4_unet/conv2d_3/Relu"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_4/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/4_unet/max_pooling2d_1/MaxPool", "StatefulPartitionedCall/4_unet/conv2d_4/Conv2D/ReadVariableOp", "StatefulPartitionedCall/4_unet/conv2d_4/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "32"}, {"size": "32"}, {"size": "32"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}]}}, "filter_format": {"s": "SFdJTw=="}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_5/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/4_unet/conv2d_4/Relu", "StatefulPartitionedCall/4_unet/conv2d_5/Conv2D/ReadVariableOp", "StatefulPartitionedCall/4_unet/conv2d_5/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "32"}, {"size": "32"}, {"size": "32"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}]}}, "filter_format": {"s": "SFdJTw=="}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/max_pooling2d_2/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/4_unet/conv2d_5/Relu"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_6/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/4_unet/max_pooling2d_2/MaxPool", "StatefulPartitionedCall/4_unet/conv2d_6/Conv2D/ReadVariableOp", "StatefulPartitionedCall/4_unet/conv2d_6/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "16"}, {"size": "16"}, {"size": "32"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}]}}, "filter_format": {"s": "SFdJTw=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_7/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/4_unet/conv2d_6/Relu", "StatefulPartitionedCall/4_unet/conv2d_7/Conv2D/ReadVariableOp", "StatefulPartitionedCall/4_unet/conv2d_7/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "16"}, {"size": "16"}, {"size": "32"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}]}}, "filter_format": {"s": "SFdJTw=="}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/max_pooling2d_3/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/4_unet/conv2d_7/Relu"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_8/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/4_unet/max_pooling2d_3/MaxPool", "StatefulPartitionedCall/4_unet/conv2d_8/Conv2D/ReadVariableOp", "StatefulPartitionedCall/4_unet/conv2d_8/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-12"}, {"size": "-13"}, {"size": "32"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}]}}, "filter_format": {"s": "SFdJTw=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_9/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/4_unet/conv2d_8/Relu", "StatefulPartitionedCall/4_unet/conv2d_9/Conv2D/ReadVariableOp", "StatefulPartitionedCall/4_unet/conv2d_9/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-12"}, {"size": "-13"}, {"size": "32"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/up_sampling2d/resize/ResizeNearestNeighbor", "op": "ResizeNearestNeighbor", "input": ["StatefulPartitionedCall/4_unet/conv2d_9/Relu", "StatefulPartitionedCall/4_unet/up_sampling2d/mul"], "attr": {"T": {"type": "DT_FLOAT"}, "align_corners": {"b": false}, "half_pixel_centers": {"b": true}}}, {"name": "StatefulPartitionedCall/4_unet/concatenate/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/4_unet/up_sampling2d/resize/ResizeNearestNeighbor", "StatefulPartitionedCall/4_unet/conv2d_7/Relu", "StatefulPartitionedCall/4_unet/concatenate/concat/axis"], "attr": {"N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_10/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/4_unet/concatenate/concat", "StatefulPartitionedCall/4_unet/conv2d_10/Conv2D/ReadVariableOp", "StatefulPartitionedCall/4_unet/conv2d_10/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "16"}, {"size": "16"}, {"size": "64"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "32"}]}]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_11/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/4_unet/conv2d_10/Relu", "StatefulPartitionedCall/4_unet/conv2d_11/Conv2D/ReadVariableOp", "StatefulPartitionedCall/4_unet/conv2d_11/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "16"}, {"size": "16"}, {"size": "32"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}]}}, "filter_format": {"s": "SFdJTw=="}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/up_sampling2d_1/resize/ResizeNearestNeighbor", "op": "ResizeNearestNeighbor", "input": ["StatefulPartitionedCall/4_unet/conv2d_11/Relu", "StatefulPartitionedCall/4_unet/up_sampling2d_1/mul"], "attr": {"T": {"type": "DT_FLOAT"}, "align_corners": {"b": false}, "half_pixel_centers": {"b": true}}}, {"name": "StatefulPartitionedCall/4_unet/concatenate_1/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/4_unet/up_sampling2d_1/resize/ResizeNearestNeighbor", "StatefulPartitionedCall/4_unet/conv2d_5/Relu", "StatefulPartitionedCall/4_unet/concatenate_1/concat/axis"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_12/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/4_unet/concatenate_1/concat", "StatefulPartitionedCall/4_unet/conv2d_12/Conv2D/ReadVariableOp", "StatefulPartitionedCall/4_unet/conv2d_12/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "32"}, {"size": "32"}, {"size": "64"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "32"}]}]}}, "filter_format": {"s": "SFdJTw=="}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_13/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/4_unet/conv2d_12/Relu", "StatefulPartitionedCall/4_unet/conv2d_13/Conv2D/ReadVariableOp", "StatefulPartitionedCall/4_unet/conv2d_13/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "32"}, {"size": "32"}, {"size": "32"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}]}}, "filter_format": {"s": "SFdJTw=="}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/up_sampling2d_2/resize/ResizeNearestNeighbor", "op": "ResizeNearestNeighbor", "input": ["StatefulPartitionedCall/4_unet/conv2d_13/Relu", "StatefulPartitionedCall/4_unet/up_sampling2d_2/mul"], "attr": {"T": {"type": "DT_FLOAT"}, "align_corners": {"b": false}, "half_pixel_centers": {"b": true}}}, {"name": "StatefulPartitionedCall/4_unet/concatenate_2/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/4_unet/up_sampling2d_2/resize/ResizeNearestNeighbor", "StatefulPartitionedCall/4_unet/conv2d_3/Relu", "StatefulPartitionedCall/4_unet/concatenate_2/concat/axis"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_14/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/4_unet/concatenate_2/concat", "StatefulPartitionedCall/4_unet/conv2d_14/Conv2D/ReadVariableOp", "StatefulPartitionedCall/4_unet/conv2d_14/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "64"}, {"size": "64"}, {"size": "64"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "32"}]}]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_15/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/4_unet/conv2d_14/Relu", "StatefulPartitionedCall/4_unet/conv2d_15/Conv2D/ReadVariableOp", "StatefulPartitionedCall/4_unet/conv2d_15/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "64"}, {"size": "64"}, {"size": "32"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/up_sampling2d_3/resize/ResizeNearestNeighbor", "op": "ResizeNearestNeighbor", "input": ["StatefulPartitionedCall/4_unet/conv2d_15/Relu", "StatefulPartitionedCall/4_unet/up_sampling2d_3/mul"], "attr": {"T": {"type": "DT_FLOAT"}, "align_corners": {"b": false}, "half_pixel_centers": {"b": true}}}, {"name": "StatefulPartitionedCall/4_unet/concatenate_3/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/4_unet/up_sampling2d_3/resize/ResizeNearestNeighbor", "StatefulPartitionedCall/4_unet/conv2d_1/Relu", "StatefulPartitionedCall/4_unet/concatenate_3/concat/axis"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_16/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/4_unet/concatenate_3/concat", "StatefulPartitionedCall/4_unet/conv2d_16/Conv2D/ReadVariableOp", "StatefulPartitionedCall/4_unet/conv2d_16/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "128"}, {"size": "128"}, {"size": "48"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "16"}]}]}}, "filter_format": {"s": "SFdJTw=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_17/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/4_unet/conv2d_16/Relu", "StatefulPartitionedCall/4_unet/conv2d_17/Conv2D/ReadVariableOp", "StatefulPartitionedCall/4_unet/conv2d_17/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "128"}, {"size": "128"}, {"size": "16"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}]}}, "filter_format": {"s": "SFdJTw=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/corners/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/4_unet/conv2d_17/Relu", "StatefulPartitionedCall/4_unet/corners/Conv2D/ReadVariableOp", "StatefulPartitionedCall/4_unet/corners/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "128"}, {"size": "128"}, {"size": "16"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "4"}]}]}}, "filter_format": {"s": "SFdJTw=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/segmentation/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/4_unet/conv2d_17/Relu", "StatefulPartitionedCall/4_unet/segmentation/Conv2D/ReadVariableOp", "StatefulPartitionedCall/4_unet/segmentation/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "128"}, {"size": "128"}, {"size": "16"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "1"}]}]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/4_unet/corners/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/4_unet/corners/BiasAdd"], "attr": {"_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "128"}, {"size": "128"}, {"size": "4"}]}]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/4_unet/segmentation/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/4_unet/segmentation/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/4_unet/corners/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity_1", "op": "Identity", "input": ["StatefulPartitionedCall/4_unet/segmentation/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 2129}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/4_unet/corners/Conv2D/ReadVariableOp", "shape": [3, 3, 16, 4], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.9121267234577852, "scale": 0.0043434605878942155, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/4_unet/corners/BiasAdd/ReadVariableOp", "shape": [4], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.31103119254112244, "scale": 0.0005106207786821852, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_8/Conv2D/ReadVariableOp", "shape": [3, 3, 32, 32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.5936157357458975, "scale": 0.004463276208615771, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_8/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.22458617845002343, "scale": 0.0013949452077641207, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_9/Conv2D/ReadVariableOp", "shape": [3, 3, 32, 32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.6149489290574017, "scale": 0.004880547056011125, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_9/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.13720150367886413, "scale": 0.001071886747491126, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/4_unet/up_sampling2d/mul", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/4_unet/conv2d_6/Conv2D/ReadVariableOp", "shape": [3, 3, 32, 32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.543720939580132, "scale": 0.003673790132298189, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_6/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.145731689415726, "scale": 0.001235014317082424, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_7/Conv2D/ReadVariableOp", "shape": [3, 3, 32, 32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.5047367993523093, "scale": 0.0036575130387848497, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_7/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.16741120251370412, "scale": 0.0010663133918070325, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/4_unet/concatenate/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/4_unet/conv2d_10/Conv2D/ReadVariableOp", "shape": [3, 3, 64, 32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.6837061281297722, "scale": 0.004527855153177299, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_10/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.05655826672035105, "scale": 0.0012033673770287458, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_11/Conv2D/ReadVariableOp", "shape": [3, 3, 32, 32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.5885629331364352, "scale": 0.004296079803915585, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_11/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.0981341004371643, "scale": 0.0014431485358406516, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/4_unet/up_sampling2d_1/mul", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/4_unet/conv2d_4/Conv2D/ReadVariableOp", "shape": [3, 3, 32, 32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.8450303077697754, "scale": 0.005523073906991996, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_4/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.2746483484611792, "scale": 0.001551685584526436, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_5/Conv2D/ReadVariableOp", "shape": [3, 3, 32, 32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.5826626492481606, "scale": 0.004348228725732542, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_5/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.2610579239971498, "scale": 0.0015266545262991214, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/4_unet/concatenate_1/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/4_unet/conv2d_12/Conv2D/ReadVariableOp", "shape": [3, 3, 64, 32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.8516087345048493, "scale": 0.006082919532177495, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_12/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.13063551468007706, "scale": 0.0015551846985723458, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_13/Conv2D/ReadVariableOp", "shape": [3, 3, 32, 32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.8671985701018688, "scale": 0.00570525375067019, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_13/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.34438744713278374, "scale": 0.002459910336662741, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/4_unet/up_sampling2d_2/mul", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/4_unet/conv2d_2/Conv2D/ReadVariableOp", "shape": [3, 3, 16, 32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.756768689436071, "scale": 0.0050451245962404734, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_2/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.056994765003522234, "scale": 0.000838158308875327, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_3/Conv2D/ReadVariableOp", "shape": [3, 3, 32, 32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.6752653687608009, "scale": 0.004562603842978384, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_3/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.11353084523888196, "scale": 0.0011467762145341612, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/4_unet/concatenate_2/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/4_unet/conv2d_14/Conv2D/ReadVariableOp", "shape": [3, 3, 64, 32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.0068949629278743, "scale": 0.006757684314952177, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_14/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.1465497928507187, "scale": 0.005790655519448074, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_15/Conv2D/ReadVariableOp", "shape": [3, 3, 32, 32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.733913218273836, "scale": 0.00489275478849224, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_15/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.17365664985834384, "scale": 0.0029433330484465057, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/4_unet/up_sampling2d_3/mul", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/4_unet/conv2d/Conv2D/ReadVariableOp", "shape": [3, 3, 3, 16], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.44227724355809833, "scale": 0.003136718039419137, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/4_unet/conv2d/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.02375077521976303, "scale": 0.00043183227672296415, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_1/Conv2D/ReadVariableOp", "shape": [3, 3, 16, 16], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.774478859059951, "scale": 0.005867264083787507, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_1/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.0730481192469597, "scale": 0.0010586683948834738, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/4_unet/concatenate_3/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/4_unet/conv2d_16/Conv2D/ReadVariableOp", "shape": [3, 3, 48, 16], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.5439783732096355, "scale": 0.009649864832560221, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_16/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.05426348424425312, "scale": 0.0021705393697701247, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_17/Conv2D/ReadVariableOp", "shape": [3, 3, 16, 16], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.8130103349685669, "scale": 0.005568563938140869, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/4_unet/conv2d_17/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.31841222445170086, "scale": 0.0027449329694112143, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/4_unet/segmentation/Conv2D/ReadVariableOp", "shape": [3, 3, 16, 1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.3829679436543409, "scale": 0.0023786828798406266, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/4_unet/segmentation/BiasAdd/ReadVariableOp", "shape": [1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.06399010866880417, "scale": 1.0, "original_dtype": "float32"}}]}]}